app/controllers/comments_controller.rb

INSERT INTO "comments" ("created_at", "page_id", "text", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-12-07 16:16:24.292936"], ["page_id", 3], ["text", "asdasdasd"], ["updated_at", "2014-12-07 16:16:24.292936"], ["user_id", 1]]
---
	def create
    	@comment = Comment.new(comment_params)
    	@comment.user_id = current_user.id
    	@comment.page_id = @page.id

    	if @comment.save

SELECT  "pages".* FROM "pages"  WHERE "pages"."id" = ? LIMIT 1  [["id", 3]]
---
   		def set_page
      		@page = Page.find(params[:page_id])