app/controllers/pages_controller.rb

INSERT INTO "pages" ("created_at", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "text", "title", "updated_at", "user_id", "video_content_type", "video_file_name", "video_file_size", "video_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
  		@page = current_user.pages.build(page_params)

  		respond_to do |format|
      		if @page.save